Revit 2027 API
WiringType Enumeration
 An enumerated type to list all wiring types.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WiringType
Public Enumeration WiringType
public enum class WiringType
type WiringType
Members
Member name | Value | Description
Arc | 0 |  Arc wiring is used to indicate wiring that is concealed within walls, ceilings, or floors.
Chamfer | 1 |  Chamfered wiring can be used to indicate wiring that is exposed.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace